# level 20: 
# 1)გზაზე მიდის 2 კაცი გრიშა და მიშა გრიშამ უთხრა მიშას შენ დაიმახსოვრე 3 > 5 მე დავიმახსოვრებ 3 < 5 რომელიც იქნება მართალი იმას მიეცეს პრიზი

# ჩვენი ამოცანაა შევქმათ 2 ცალადი და მათ დავამახსოვრებინოთ ზემოთ ხსენებული მნისნელობები და if else ის გამოყენებით დავწეროთ თუ ვის გადაეცემა პრიზი დადავპრინოტოთ ტერმინალში|

misha = 3 > 5
grisha = 3 < 5

if misha:
    print("პრიზი გადაეცემა მიშას")
elif grisha:
    print("პრიზი გადაეცემა გრიშას")

# 2)გზაზე მიდის 10 მაგრამ 2 მა კაცმა გადაილაპარაკეს  გრიშამ და მიშამ გრიშამ უთხრა მიშას შენ დაიმახსოვრე 3 > 5 მე დავიმახსოვრებ 3 < 5 რომელიც იქნება მართალი იმას მიეცეს პრიზი ჩვენი 10 კაციდან

# ჩვენი ამოცანაა შევქმათ 2 ცალადი და მათ დავამახსოვრებინოთ ზემთ ხსენებული მნისნელობები და if else ის გამოყენებით დავწეროთ თუ ვის გადაეცემა პრიზი ან გრიშას ან მიშას თუ არა და სხვა ვინმეს, საბოლოოდ კი გამოვიტანოთ ტერმინალში

if misha:
    print("პრიზი გადაეცემა მისჰას")
elif grisha:
    print("პრიზი გადაეცემა გრიშას")
else:
    print("პრიზი მოიგო სხვამ")
    