# 1) ფუნქციის შექმნა: შექმენი ფუნქცია, რომელიც მიიღებს სია და დააბრუნებს იმ ელემენტების რაოდენობას, რომლებიც მათ შორის დადებითია.
def count(lst):
    count = 0
    for x in lst:
        if x > 0:
            count += 1
    return count
# 2) გამოთვლა: შექმენი lambda ფუნქცია, რომელიც მიიღებს ორ რიცხვს და დააბრუნებს მათი ჯამს თუ ორივე რიცხვი დადებითია, თუ არა, დააბრუნოს "Invalid".
# ვერ გავიგე
# 3) ფილტრაცია: დაწერე პროგრამა, რომელიც მიიღებს სიას და ფილტრავს ყველა თაყვანისმცემელი რიცხვებისგან (პრაიმ-ნუმერებისგან). გამოსატანია მხოლოდ პრაიმ-ნუმერები.3) ფილტრაცია: დაწერე პროგრამა, რომელიც მიიღებს სიას და ფილტრავს ყველა თაყვანისმცემელი რიცხვებისგან (პრაიმ-ნუმერებისგან). გამოსატანია მხოლოდ პრაიმ-ნუმერები.
# ესეც ვერ გავიგე

# 4) დაწერე ფუნქცია, რომელიც მიიღებს ორ სტრიქონს და დააკავშირებს მათ მხოლოდ იმ შემთხვევაში, თუ ორივე სტრიქონი შეიცავს მინიმუმ ერთ ვოკალს.
def contains_vowel(s):
    vowels = "aeiouAEIOU"
    for char in s:
        if char in vowels:
            return True
    return False
# 5) მაქსიმალური ელემენტი: დაწერე ფუნქცია, რომელიც მიიღებს სია და დააბრუნებს იმ ელემენტს, რომელიც ყველაზე დიდი ხანგრძლივობით არის. (მაგალითად, თუ გვყავს სია ["apple", "banana", "cherry"], ფუნქციამ უნდა დააბრუნოს "banana").

