# 1)გზაზე მიდის მელი და შეხვდება დათვს
# მელიას დათვი ეკითხება:
# შენ თაფლი გიყვარს?
# კი, მიყვარს!
# მაშინ თუ ჩემს თავსატეხს ამოხსნი, თაფლს გაჭმევ, თუ ვერ - აქედან გაეთრიე!
# ფუნქცია:
# დათვი მელიას სთხოვს, რომ გადასცეს 6 ციფრისგან შემდგარი სია და იპოვოს მასში მაქსიმალური და მინიმალური რიცხვი.


# ვერ გავიგე



# 2)ორი კუ ერთმანეთს ეჯიბრება სირბილში
# პირველი კუ ამბობს:
# მოდი, შევამოწმოთ ვინ უფრო სწრაფია!
# მეორე კუ პასუხობს:
# კარგი, მაგრამ თუ ჩემს თავსატეხს ვერ ამოხსნი, მაშინ უარით ვიწვევ გამარჯვებას!
# ფუნქცია:
# მომხმარებელი უნდა შეიყვანოს ორი რიცხვი, რომლებიც კუების სიჩქარეებს აღნიშნავენ, შემდეგ კი პროგრამამ უნდა განსაზღვროს რომელი კუა უფრო სწრაფი და გამოიტანოს შედეგი.

def speeds(speed1, speed2):
    if speed1 > speed2:
        return "პირველი კუ უფრო სწრაფია!"
    elif speed1 < speed2:
        return "მეორე კუ უფრო სწრაფია!"
    else:
        return "ორივე კუ  სწრაფია!"
speed1 = int(input("შეიყვანეთ პირველი კუს სიჩქარე: "))
speed2 = int(input("შეიყვანეთ მეორე კუს სიჩქარე: "))
result = speeds(speed1, speed2)
print(result)

# 3)თახვი და მდინარის გამოცდა
# თახვს უნდა გადაცუროს მდინარე, მაგრამ ნიანგმა გააჩერა:
# აქ ვერ გადახვალ, თუ ჩემს გამოცანას არ ამოხსნი!
# რა გამოცანა?
# უნდა შეიყვანო ხუთი რიცხვი და ამოაგდო მათ შორის ყველაზე დიდი.
# ფუნქცია:
# მომხმარებელი შეიყვანს 5 რიცხვს, ფუნქციამ კი უნდა ამოაგდოს ყველაზე დიდი და დააბრუნოს დანარჩენები.
# ამ ფუნქციით ვიპოვით ყველაზე დიდ რიცხვს და დანარჩენებს დავბრუნებთ
    # ვერ გავიგე


# 4)ძაღლი და ძვლის გამოცანა
# ძაღლს სურს ძვლის აღება, მაგრამ ბომბის რობოტმა გააჩერა:
# თუ ჩემს გამოცანას ვერ ამოხსნი, ძვლას ვერ აიღებ!
# რა გამოცანა?
# უნდა შეიყვანო სამი რიცხვი და დაამატო მათ ყველას 10.
# ფუნქცია:
# მომხმარებელი შეიყვანს სამ რიცხვს, პროგრამამ კი თითოეულს 10 უნდა დაამატოს და დააბრუნოს შედეგები.
    # ვერ გავიგე

# 5)მგელი და ბატკნის გამოცდა
# მგელმა ბატკანი დაიჭირა და უთხრა:
# თუ ჩემს გამოცანას ამოხსნი, გაგიშვებ!
# რა გამოცანა?
# უნდა შეიყვანო სიტყვა და თუ ის "ბატკანია", მაშინ დაიძვრენ, თუ არა - მოგკლავ!
# ფუნქცია:
# მომხმარებელი შეიყვანს სიტყვას. თუ სიტყვა "ბატკანია", ფუნქციამ უნდა დააბრუნოს "გადარჩი!" თუ სხვა რამეა, უნდა დააბრუნოს "მგელმა შეგჭამა!".

# ამ ფუნქციით შევამოწმებთ, არის თუ არა სიტყვა "ბატკანია"
def wolf_and_sheep(word):
    if word == "ბატკანია":
        return "გადარჩი!"
    else:
        return "მგელმა შეგჭამა!"

word = input("შეიყვანეთ სიტყვა: ")
result = wolf_and_sheep(word)
print(result)
