# 1) ჩემს ოთხში არის 78 გრადუსი თუ ცვლადის მნიშნველობა ინქბეა 78 ზე მეტი მაგ შემთხვეავაში გამოიტანოს ❤️ "უჰ დავიწვით კაცო დაუწიე!"
# თუ არა:
# "უი რა კაი სიგრეილეა!"
def temperature():
    temperature = 100
    if temperature > 78:
        print ("❤️ უჰ დავიწვით კაცო დაუწიე!")
    else:
        print("უი რა კაი სიგრეილეა!")
print(temperature(78))
print(temperature(22))
# 2)  ჩემს ოთახში არის 78 გრადუსი თუ ცვლადის მნიშნველობა ინქბეა 78 ზე მეტი მაგ შემთხვეავაში გამოიტანოს ❤️ "უჰ დავიწვით კაცო დაუწიე!"
# თუ არა:
# "უი რა კაი სიგრეილეა!"

# ასევე გავმარტივოთ ჩვენი ფუქნცია და არგუმენტების და პარატმეტრების მეშვეობით განვაახლოჩ ჩვენი დაწერილი ფუნქცია

# ასევე დავალამტოთ კიდევ 2 condition (elif) სხვადასხვა პირობებით 

# # დამინუმუმ 5 მაგალითი დავწეროთ
def temperature(gradusi):
    if gradusi >= 78:
        return "უჰ დავიწვით კაცო დაუწიე"    
    elif gradusi >= 50:
        return "უი რა კაი სიგრეილეა!"
    elif gradusi >= 50:
        return "უი რა კაი სიგრეილეა!"
    else:
        return "რამე სხვა"
print(temperature(78))