# 1) გააკეთეთ 5 მაგალითი for loop-ზე და კარგად ახსენით კომენტარის სახით
# 1)
n = 3
def number(n):
    return n ** 3
print(number(n)) #დააბრუნებს 27-ს
# 2)
for i in range(11):
    print(i) # დააბრუნებს 0,1,2,3,4,5,6,7,8,9,10-ს
# 3)
t="Hello World"
for i in t:
    print(i) # დააბრუნებს Hello World-ს
# 4)
for i in range(1, 10, 2):
    print(i) # დააბრუნებს 1,3,5,7,9-ს

# 2) გააკეთეთ 5 მაგალითი while loop-ზე და კარგად ახსენით კომენტარის სახით.
# 1)
n = 0
while n < 5:
    print(n) # დააბრუნებს 0,1,2,3,4-ს
    n += 1
# 2)
n =  0
while n < 10:
    print(n) # დააბრუნებს 0,1,2,3,4,5,6,7,8,9-ს
    n += 1
    
# 3) გააკეთეთ ყველა კოუდვარსი რაც გაკვეთილზე იყო და ძველი მოცემული კოუდვარსებიც. ამის სქრინები დავალების ფაილში აუცილებლად ატვირთეთ.
