// # 1)

// **დავალება:**
// შექმენი მასივი, რომელიც შეიცავს სტუდენტების სახელებს. გამოიყენე `forEach`, რათა თითოეულ სტუდენტს გადაუგზავნო მესიჯი: “გამარჯობა \[სტუდენტის სახელი], წარმატებები შენს პროექტში!”

// **მაგალითი:**
// მასივი: `["თამარი", "გიორგი", "მარიამი"]`
// მოაწყვე მესიჯი:

// * "გამარჯობა თამარი, წარმატებები შენს პროექტში!"
// * "გამარჯობა გიორგი, წარმატებები შენს პროექტში!"
// * "გამარჯობა მარიამი, წარმატებები შენს პროექტში!"

// ---
const names = ["თამარი", "გიორგი", "მარიამი"];

names.forEach(name => {
    console.log(`გამარჯობა ${name}, წარმატებებს გისურვებ!`);
});

//  # 2)

// **დავალება:**
// შექმენი მასივი შემთხვევითი რიცხვებით (3-დან 10-მდე). გამოიყენე `forEach`, რომ თითოეული რიცხვი გაორმაგდეს და შედეგი კონსოლში გამოჩნდეს.

// **მაგალითი:**
// მასივი: `[3, 5, 7]`
// პასუხი:

// * 3 \* 2 = 6
// * 5 \* 2 = 10
// * 7 \* 2 = 14

// შედეგი:

// ```
// 6
// 10
// 14
// ```
// ---
const numbers = [3, 5, 7];

numbers.forEach(num => {
    console.log(num * 2);
})

//  # 3)

// **დავალება:**
// შექმენი მასივი, რომელშიც არის პროდუქტის სახელები. გამოიყენე `forEach`, რომ კონსოლში დაბეჭდო: "პროდუქტი \[პროდუქტის სახელი] არის გაყიდვაში!"

// **მაგალითი:**
// მასივი: `["ლეპტოპი", "სმარტფონი", "მაგიდის ლამპა"]`
// მოაწყვე შედეგი:

// * "პროდუქტი ლეპტოპი არის გაყიდვაში!"
// * "პროდუქტი სმარტფონი არის გაყიდვაში!"
// * "პროდუქტი მაგიდის ლამპა არის გაყიდვაში!"
// ---
const products = ["ლეპტოპი", "სმარტფონი", "მაგიდის ლამპა"];

products.forEach(product => {
    console.log(`პროდუქტი ${product} არის გაყიდვაში!`);
})
//  # 4)

// **დავალება:**
// შექმენი მასივი ცხოველების სახელებით. გამოიყენე `forEach`, რათა თითოეული ცხოველის სახელი გამოიტანო და წინა ტექსტთან ერთად:

// **მაგალითი:**
// მასივი: `["პეტი", "თექია", "გოჭი"]`
// მოაწყვე შედეგი:

// * "ცხოველი პეტი არის სახიფათო!"
// * "ცხოველი თექია არის სახიფათო!"
// * "ცხოველი გოჭი არის სახიფათო!"
// ---
const animals = ["პეტი", "თექია", "გოჭი"];
animals.forEach(animal => {
    console.log(`ცხოველი ${animal} არის სახიფათო!`);
})
//  # 5)

// **დავალება:**
// შექმენი მასივი პროდუქციის ფასებით. გამოიყენე `forEach`, რომ თითოეული ფასის შემდეგ გამოიტანო ტექსტი: "ფასი \[ფასი] არის ნორმალური", თუ ფასი არ აღემატება 100-ს, და "ძალიან მაღალი ფასი", თუ მეტი.

// **მაგალითი:**
// მასივი: `[150, 75, 30]`
// პასუხი:

// * "ფასი 150 არის ძალიან მაღალი ფასი"
// * "ფასი 75 არის ნორმალური"
// * "ფასი 30 არის ნორმალური"

// ---
const prices = [150, 75, 30];

prices.forEach(price => {
    if(price >= 150) {
        console.log(`ფასი ${price} არის ძალიან მაღალი ფასი`)
    } else {
        console.log(`ფასი ${price} არის ნორმალური`)
    }
})

// # 6)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც მიიღებს ორი მასივიდან მხოლოდ საერთო ელემენტებს და დააბრუნებს ახალ მასივს.

// **მაგალითი:**
// მასივები:

// * `["apple", "banana", "cherry"]`
// * `["banana", "cherry", "date"]`
//   პასუხი: `["banana", "cherry"]`

// ---
const arr1 = ["apple", "banana", "cherry"];
const arr2 = ["banana", "cherry", "date"];

const arr3 = arr1.filter(str => arr2.includes(str));

console.log(arr3)

//  # 7)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც მიიღებს ციფრებს და დააბრუნებს მათ ნამრავლს.

// **მაგალითი:**
// მასივი: `[2, 3, 4]`
// პასუხი: `2 * 3 * 4 = 24`
// ---
const nums = [2, 3, 4];
let result = 1;

nums.forEach(num => {
    result *= num
})

console.log(result)
//  # 8)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც მიიღებს თარიღს (დღე, თვე, წელი) და დააბრუნებს თარიღს ფორმატში "yyyy-mm-dd".

// **მაგალითი:**
// თარიღი: `დაღ. 2023-09-09`
// პასუხი: `"2023-09-09"`
// ---
function makeDate(year, month, day) {
    return `${year}-${month}-${day}`;
}
//  # 9)

// **დავალება:**
// შექმენი პროგრამა, რომელიც მიიღებს სხვადასხვა მონაცემთა ტიპებს და დააბრუნებს ყველაზე დიდ მნიშვნელობას მათგან.

// **მაგალითი:**
// მასივი: `[2, "hello", true, 8]`
// პასუხი: `8`
// ---
const arr = [2, "hello", true, 8];
const numArr = []

arr.forEach(x => {
    if(typeof x === 'number') {
        numArr.push(x);
    }
});

console.log(Math.max(...numArr));
//  # 10)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც ითვლის და გამოაქვს მასივში არსებული ყველა ელემენტის ჯამი.

// **მაგალითი:**
// მასივი: `[10, 20, 30]`
// პასუხი: `10 + 20 + 30 = 60`

// ---
const nums2 = [2, 3, 4];
let result2 = 0;

nums2.forEach(num => {
    result2 += num
})

console.log(result2)

// # 11)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც მიიღებს თარიღს და დააბრუნებს დღესასწაულს. მაგალითად: “დღეს არის ორშაბათი”.

// **მაგალითი:**
// დღე: `2023-09-09`
// პასუხი: "დღეს არის შაბათი"

// ---
function day(date) {
    const days = ['sunday', 'monday', 'tuesday', 'wednesday', 'thursday', 'friday', 'saturday'];

    const date = new Date(date);
    return days[date.getDay()];
}
//  # 12)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც შეამოწმებს მომხმარებლის ასაკს. თუ ის 18-ზე მეტია, დაუწერს “შეძლევ სასმელის ყიდვას”, თუ ნაკლებია - “სასმელის ყიდვა აკრძალულია”.

// **მაგალითი:**
// ასაკი: `19`
// პასუხი: “შეძლევ სასმელის ყიდვას”

// ---
function determineAge(age) {
    if(age >= 18) {
        return 'შეძლევ სასმელის ყიდვას';
    } else {
        return 'სასმელის ყიდვა აკრძალულია';
    }
}

//  # 13)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც ითვლის თუ რამდენად სწორია გამოიყენებული მონაცემები. თუ ისინი არასწორია, დაბეჭდავს “გთხოვთ, შეიყვანოთ სწორი მონაცემები!”

// **მაგალითი:**
// მოთხოვნა: “აირჩიე 5-ზე მეტი ელემენტი”
// ჩაწერილი: `["apple", "banana"]`
// პასუხი: “გთხოვთ, შეიყვანოთ სწორი მონაცემები!”

// ---
function arrayFn(arr) {
    if(arr.length !== 5) {
        return 'აირჩიე 5-ზე მეტი ელემენტი'
    } else {
        return 'გთხოვთ, შეიყვანოთ სწორი მონაცემები!'
    }
}
//  # 14)

// **დავალება:**
// შექმენი პროგრამა, რომელიც გამოიყენებს **switch**-statement-ს (განმსაზღვრელ ცვლის) კონკრეტული საქმის მიხედვით.

// **მაგალითი:**
// მომხმარებელი აინტერესებს კვირის დღეების ნომრები. თუ იგი იტყვის “1”, გამოჩნდება “ორშაბათი”, თუ “2” - “სამშაბათი” და ასე შემდეგ.

// ```javascript
// switch (number) {
//   case 1:
//     console.log("ორშაბათი");
//     break;
//   case 2:
//     console.log("სამშაბათი");
//     break;
//   case 3:
//     console.log("ოთხშაბათი");
//     break;
//   // დამატებითი cases
//   default:
//     console.log("არასწორი ინფორმაცია");
// }
// ```
// ---
const number = prompt();
switch (number) {
    case 1:
        console.log("ორშაბათი");
        break;
    case 2:
        console.log("სამშაბათი");
        break;
    case 3:
        console.log("ოთხშაბათი");
        break;
    case 4:
        console.log('ხუთშაბათი')
        break
    case 5:
        console.log('პარასკევი')
        break;
    case 6:
        console.log('შაბათი')
        break;
    case 7:
        console.log('კვირა')
        break;
    default:
        console.log("არასწორი ინფორმაცია");
}
//  # 15)

// **დავალება:**
// შექმენი ფუნქცია, რომელიც მიიღებს მასივში თითოეული ელემენტის სიგრძეს (თუ ეს არის ტექსტი) და დააბრუნებს ამ სიგრძეების ოდენობას.

// **მაგალითი:**
// მასივი: `["apple", "banana", "cherry"]`
// პასუხი: `[5, 6, 6]`
const list = ["apple", "banana", "cherry"]
const list1 = [];

for(let i = 0; i < list.length; i ++) {
    list1.push(list[i].length);
}

console.log(list1)