# 1)
# შევქნანთ ფუნქცია სადაც გადმოგვეცემა 2 პარამეტრი a, b 

# ჩვემნი მიაზანია, რომ ეს ორი პარამატრი გავარმავლოთ ერთმანეთზე, მინუმუმ 5 მაგალითი დაუწერე და ჩაუგდე შიოს <3 <3 
def a_b(a, b):
    return a * b
print(a_b(7,2))
print(a_b(7,8))
print(a_b(3,4))
print(a_b(5,4))
print(a_b(5,7))

# 2)
# გყავს მოთამშე player რომელსაც სიცცოხლე ეს სიცოცხე არის intager
# შევამნათ 2 ფუქნცია სადაც ჩვენს player-ს 
# 1) აემატება სისცოცოხლე increes_health()
# 2) დააკლდება სიცოცხლე decress_health()

# tip:ფუქნციას მინუმუმ უნდა გადაეცეს 1 პარამეტრი ❤️

# დავალება:  შევმნათ ერთ იფუქნიცია main() სადაც გამოვიძახებთ ჩვენს ზემოთ შექმნილ ფუქნციევბს
# საბოლოოდ კი დავპირინტავთ სიცოცხლის რაოდენობა
def increes_health(health):
    return health -10 
def decress_health(health):
    return health +10
def main():
    print(increes_health(100))
    print(decress_health(100))
main()
# 3)
# დავალება ნუგზარ ჩუბინძიე
# ნუგზარ ჩუბინიძე ამობობს სადღეგრძელოს

# ჩვენი ამოცანა მდებაროებს შემდეგში:
# შევქმანთ ფუქნცია nugzar_chubinidze() რომელსაც 2 პარამეტრი , sadgerdzelo, limit

# თუ ნუგზარს limit -ზე მეტი ექნება დალეული ჩვენმა ფუქნციამ უნდა გამოგვიტანოს რომ იგი ლუიზა: ნუგზარი აღარ დალიო მეტი! 
# ხოლო თუ არ ცდება limit -ს მაგ შემთხვევაში დაგვიბრუნოს მოდი ახლა მართლა, დამილოცნიე!
def nugzar_chubinidze(sadgerdzelo, limit):
    if sadgerdzelo > limit:
        return "ნუგზარი აღარ დალიო მეტი! "
    else:
        return "მოდი ახლა მართლა, დამილოცნიე!"
print(nugzar_chubinidze(50, 100))
print(nugzar_chubinidze(100, 150))


# 4)
# დავალება ესი ვენტურაზე-ზე რთული
# შევქნათ ფუქნცია რამდენჯერ ესროლოეს ფეხში ეის ვენტურას ქვას

# ფუქცია შევქმანთ ქვის სროლის stone_throw() ცალკე
# თუ 2 ზე ნაკლებს იქნება გამოძახებული ფუნქცია ანუ 2 ზე მეტ-ჯერ ვისვრით ქვას 

# დაიძხებს ეის ვენტურა!
# ვაიმე პირდაპირ ფეხში მომხვდა!

# თუ ორზე მეტჯერ ესვიან :

# ვაიმე ორივე ფეხში მომხვდა!!
